app/views/pitems/index.html.erb

   </p>
      <% p.tasks.each do |t| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."pitem_id" = 4