app/controllers/pitems_controller.rb

SELECT "pitems".* FROM "pitems"
---
  def index
    @pitems = Pitem.all

UPDATE "pitems" SET "pname" = 'jhhdd', "updated_at" = '2012-12-18 19:17:04.595233' WHERE "pitems"."id" = 5
---
  def update
   @pitem.update_attributes(params[:pitem])

DELETE FROM "pitems" WHERE "pitems"."id" = ?  [["id", 2]]
---
  def destroy
    @pitem.destroy

INSERT INTO "pitems" ("created_at", "pname", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 17 Dec 2012 11:16:21 UTC +00:00], ["pname", "kuku"], ["updated_at", Mon, 17 Dec 2012 11:16:21 UTC +00:00]]
---
  def create
    @pitem = Pitem.create(params[:pitem])

SELECT "pitems".* FROM "pitems" WHERE "pitems"."id" = ? LIMIT 1  [["id", "5"]]
---
    def find_pitem
       @pitem = Pitem.find(params[:id])