app/controllers/tasks_controller.rb

UPDATE "tasks" SET "tname" = 'ngjhgdd', "updated_at" = '2012-12-23 11:39:59.189476' WHERE "tasks"."id" = 60
---
  def update
   @task.update_attributes(params[:task])

INSERT INTO "tasks" ("created_at", "done", "expires_at", "pitem_id", "priority", "status", "tname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(params[:task])
    @task.pitem_id = params[:pitem_id]
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "62"]]
---
    def find_task
       @task = Task.find(params[:id])